#所有的模块要经历的两个步骤
	#要操作的概念本身： 正则表达式   时间
	#使用模块去操作它：   re        time

#学习 正则表达式  本身
	#什么是正则表达式
		#一种匹配字符串的规则
		#input 一串数据
			#是不是qq号码： 全数字 5位以上  12位以下，第一位不是零
			#是不是身份证号：18位/15位 第一位不是零  18位的最后一位可能是x或数字
		#有一个文件
			#要你把这个文件中所有的手机号都摘取出来
	#正则表达式能做作什么
		#可以定制一个规则，
			#1.来确认某一个字符串是否符合规则
			#2 从大段的字符串中找到符合规则的内容
		#程序领域
			#1.登陆注册页的表单验证  web开发 要求简单语法
			#2.爬虫
				#爬虫 把这个网页下载下来，从里面提取一些信息，找到我要的所有信息，做数据分析
			#3.自动化开发  日志分析
# 什么是正则表达式 : 一种匹配字符串的规则

# 明确一件事:
    # 正则表达式是一种独立的语法
    # 和python没关系

# 要先学习正则的语法
# 再学习使用python来操作正则

# 帮助学习的工具 http://tool.chinaz.com/regex/




























