# -*- coding: utf-8 -*-
"""
@Time ： 2020/3/8 15:36
@Auth ： Sam
@File ：12.字符串相关操作.py
@IDE ：PyCharm
"""
# ### 字符串相关操作
# (1)字符串的拼接 +
res = "我爱你" + "亲爱的菇凉"
print(res)
s1 = "我爱你"
s2 = "亲爱的祖国"
res = s1 + s2
print(res)
# (2)字符串的重复 *
strvar  = "重要的事情说三遍"
res = strvar * 3
print(res)

# (3)字符串跨行拼接 \
strvar = "水电费水电费sdkfjsjdfjksjdfksjdkjskdjfksjdfkjskdf"\
"aaabbbccc"
print(strvar)
# (4)字符串的索引
#          0 1 2 3 4 5 6 7 8  正向索引
strvar = "咱们班的女生特别多"
#         -9-8-7-6-5-4-3-2-1  逆向索引
res = strvar[6]
print(res)
res = strvar[-3]
print(res)

# (5)字符串的切片: 字符串的截取
"""
语法 => 字符串[::]  完整格式：[开始索引:结束索引:间隔值]
	(1)[开始索引:]  从开始索引截取到字符串的最后
	(2)[:结束索引]  从开头截取到结束索引之前(结束索引-1)
	(3)[开始索引:结束索引]  从开始索引截取到结束索引之前(结束索引-1)
	(4)[开始索引:结束索引:间隔值]  从开始索引截取到结束索引之前按照指定的间隔截取字符
	(5)[:]或[::]  截取所有字符串
"""
# listvar = ["王子红","麦秸康","友军表","王铁男","庄泽浩","好舌头","王文多一个字","刘璐","李志华","文招财","陈凤杰"]
strvar = "黑夜给了我黑色的眼睛,我却用它翻白眼"
# (1)[开始索引:]  从开始索引截取到字符串的最后
res = strvar[3:]
print(res)
# (2)[:结束索引]  从开头截取到结束索引之前(结束索引-1)
res = strvar[:8]
print(res)
# (3)[开始索引:结束索引]  从开始索引截取到结束索引之前(结束索引-1)
res = strvar[5:10] # 最大下标10取不到
print(res)
# (4)[开始索引:结束索引:间隔值]  从开始索引截取到结束索引之前按照指定的间隔截取字符

# 正向获取
res = strvar[::3]
# 0 3 6 9 12 15  黑 了 色 睛 却 翻
print(res)

# 逆向获取
res = strvar[::-1]
#-1 -2 -3 -4 ... 一直到最后
print(res)

